app/controllers/admin_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 347)
SELECT `portfolios`.* FROM `portfolios` INNER JOIN `users` ON `users`.id = `portfolios`.user_id WHERE (`users`.`activate` = 1) ORDER BY created_at DESC
---
  def portfolios
    @user_active =  Portfolio.find(:all, :joins => :user, :conditions => {:users => {:activate => 1}},:order => 'created_at DESC').length