app/controllers/design_directories_controller.rb

  def index
    @title = "Design Directory of Indian design companies"
    @records_for_more_button = DesignDirectory.find(:all, :joins => :user, :conditions => {:users => {:activate => 1}})
    @design_directories = DesignDirectory.paginate(:page => params[:page], :per_page => 18, :joins => :user, :conditions => {:users => {:activate => 1}} , :order => 'updated_at DESC')
---
SELECT * FROM `users` WHERE (`users`.`id` = 350)
SELECT `design_directories`.* FROM `design_directories` INNER JOIN `users` ON `users`.id = `design_directories`.user_id WHERE (`users`.`activate` = 1)
SELECT `design_directories`.* FROM `design_directories` INNER JOIN `users` ON `users`.id = `design_directories`.user_id WHERE (`users`.`activate` = 1) ORDER BY updated_at DESC LIMIT 0, 18
SELECT count(*) AS count_all FROM `design_directories`