app/controllers/images_controller.rb

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 0)