app/controllers/job_posting_details_controller.rb

SELECT * FROM `job_posting_details` WHERE (`job_posting_details`.`id` = 0)
---
  def show
    @job_posting_detail = JobPostingDetail.find(params[:id])