app/controllers/job_applications_controller.rb

INSERT INTO `job_applications` (`activation_key`, `created_at`, `portfolio_file_name`, `portfolio_content_type`, `Name`, `specialization`, `cover_letter`, `updated_at`, `resume_link`, `resume_file_name`, `portfolio_file_size`, `user_id`, `resume_content_type`, `resume_file_size`, `portfolio_link`, `activate`, `job_id`, `email`) VALUES('22cf32c3', '2010-10-13 10:51:06', 'teja.gif', 'image/gif', 'rajesh', 'Graphic Designer', 'rasdfvadf', '2010-10-13 10:51:06', 'http://', 'teja.gif', 1960, NULL, 'image/gif', 1960, 'http://', 0, 453, 'rajesh.13kits@gmail.com')
---
  def create
    logger.info"in create of job_contr #{params.inspect}"
    @job_application = JobApplication.new(params[:job_application])
    @job_application.activation_key = SecureRandom.hex(4)
    respond_to do |format|
      if @job_application.save

SELECT * FROM `job_applications` WHERE (`job_applications`.`activation_key` = '22cf32c3') LIMIT 1
UPDATE `job_applications` SET `updated_at` = '2010-10-13 10:51:31', `activate` = 1 WHERE `id` = 207
---
  def activate
    @job_application = JobApplication.find_by_activation_key(params[:id])
    @job_application.update_attribute(:activate, 1)