app/controllers/jobs_controller.rb

  def create_after_login_for_team_dezineconnect

    @job_posting_detail = JobPostingDetail.new(params[:job_posting_detail])
    @job = Job.new(params[:job])
    @job.activation_key = ActiveSupport::SecureRandom.hex(4)
    @job[:activate] = 0

    unless session[:registered_user_id].nil? or session[:registered_user_id].blank? then
      @user = User.find_by_id(session[:registered_user_id])
      @job.user_id = @user.id
    end
    respond_to do |format|
      if @job.save
        @job_posting_detail[:job_id] = @job.id
        if @job_posting_detail.save
---
INSERT INTO `job_posting_details` (`job_source`, `created_at`, `updated_at`, `job_poster`, `job_source_text`, `job_id`) VALUES('Bixee.com', '2010-10-20 17:07:30', '2010-10-20 17:07:30', 'Rajesh Banoth', 'Naukari', 482)

  def create
    unless params[:ex_email].blank? or params[:ex_email].nil? or params[:ex_password].blank? or params[:ex_password].blank? or params[:ex_password].nil? then

      @job = Job.new(params[:job])
      @job.activation_key = ActiveSupport::SecureRandom.hex(4)

      @user_name = params[:ex_email]
      @password = params[:ex_password]

      @user = User.find_by_email(params[:ex_email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'rajesh.13kits@gmail.com') LIMIT 1

  def update_external_job
    @job = Job.find(params[:id])
    @job_posting_detail = JobPostingDetail.find_by_job_id(@job.id)
    @job.update_attribute(:activate, 0)
---
SELECT * FROM `job_posting_details` WHERE (`job_posting_details`.`job_id` = 492) LIMIT 1
UPDATE `job_posting_details` SET `updated_at` = '2010-10-21 10:50:07', `job_source` = 'select', `job_source_text` = 'dezineconnect.com', `job_poster` = 'Rajesh' WHERE `id` = 10