app/controllers/portfolios_controller.rb

SELECT `portfolios`.* FROM `portfolios` INNER JOIN `users` ON `users`.id = `portfolios`.user_id WHERE (`users`.`activate` = 1) ORDER BY updated_at DESC LIMIT 0, 18
SELECT count(*) AS count_all FROM `portfolios` INNER JOIN `users` ON `users`.id = `portfolios`.user_id WHERE (`users`.`activate` = 1)
---
  def index
    @title = "Portfolios of Indian designers"
    @portfolios = Portfolio.paginate(:page => params[:page], :per_page =>18, :joins => :user, :conditions => {:users => {:activate => 1}} , :order => 'updated_at DESC')

SELECT * FROM `portfolios` WHERE (`portfolios`.user_id = 350) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 350) LIMIT 1
---
  def show
    @portfolio = Portfolio.find(params[:id])
    unless @portfolio.user.activate == 1 then
      @title = "#{@portfolio.user.firstname.capitalize} #{@portfolio.user.lastname.capitalize}, #{@portfolio.city.capitalize}, #{@portfolio.country.capitalize}, #{@portfolio.specialization.capitalize}"