app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'rajesh@kern-comm.com') LIMIT 1
INSERT INTO `users` (`activation_key`, `created_at`, `updated_at`, `lastname`, `firstname`, `activate`, `password`, `email`) VALUES('510e0e50', '2010-10-20 15:10:30', '2010-10-20 15:10:30', 'rathod1213', 'rajesh1213', 0, 'rajesh', 'rajesh@kern-comm.com')
---
  def create

    @user = User.new(params[:user])
    @user.activation_key = SecureRandom.hex(4)
    @user_status = User.find_by_email(params[:user][:email])

    unless @user_status.nil? or @user_status.blank? then
      respond_to do |format|
        flash[:notice] = 'this email is already registed with us. please <a href="/login" id="login_link">login</a>'
        unless session[:directory_listing_obj].nil? or session[:directory_listing_obj].blank? then
          format.html { redirect_to("/users/new?directory=FreeListing") }
        else
          format.html { redirect_to("/users/new") }
        end
      end
    else

      logger.info "@user_status : #{@user_status.inspect}"
      respond_to do |format|
        if @user.save

SELECT * FROM `users` WHERE (`users`.`email` = 'team@dezineconnect.com') LIMIT 1
SELECT * FROM `portfolios` WHERE (`portfolios`.user_id = 230) LIMIT 1
SELECT * FROM `images` WHERE (`images`.`portfolio_id` = 237) LIMIT 1
---
  def login
    logger.info "params[:login] : #{params[:login]} #{params[:password]}"
    unless params[:login].nil? and params[:password].nil? then
      if params[:login]=="admin@dezineconnect.com" and params[:password]=="teamdezineconnect" then
        session[:is_admin] = true
        redirect_to '/admin/portfolios'
      elsif params[:login]=="team@dezineconnect.com" and params[:password]=="kern123" then
        @user = User.find_by_email(params[:login])
        unless @user.nil? then
          logger.info "@user.password : #{@user.password}}"
          if @user.password == params[:password] then
            session[:loggedin_user] = @user.id
            session[:is_dezineconnect_team] = true
            redirect_to '/jobs/dashboard'
          end
        end
      else
        @user = User.find_by_email(params[:login])
        unless @user.nil? then
          logger.info "@user.password : #{@user.password}}"
          if @user.password == params[:password] then
            session[:loggedin_user] = @user.id
            unless @user.portfolio.nil? or @user.portfolio.blank? then
              @images = Image.find_by_portfolio_id(@user.portfolio.id)

SELECT * FROM `design_directories` WHERE (`design_directories`.user_id = 350) LIMIT 1
---
              end

            else
              unless @user.design_directory.nil? or @user.design_directory.blank? then

SELECT * FROM `users` WHERE (`users`.`email` IS NULL) LIMIT 1
---
  def forgot
    @user = User.find_by_email(params[:login])